Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_Gujarat.c
    case 5:		// Current - R with direction
			tempLong = getInstantaneousParams(ICURRENTS,LINE_PHASE_R)*1000;
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			lcd_display_A();
      break;

    case 6:		// Current - Y with direction
			tempLong = getInstantaneousParams(ICURRENTS,LINE_PHASE_Y)*1000;
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_Y);
			lcd_display_A();
      break;

   	case 7:		// Current - B with direction
			tempLong = getInstantaneousParams(ICURRENTS,LINE_PHASE_B)*1000;
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_B);
			lcd_display_A();
      break;

   	case 8:		// Neutral Current
			tempLong = (int32_t)(EM_GetCurrentRMS(LINE_NEUTRAL)*100);
			display_long_two_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_N);
			LCD_DisplayDigit(8, LCD_CHAR_C);
			lcd_display_A();
			break;	
			
		case 9:		// Line Frequency
			tempLong = getInstantaneousParams(IFREQS,LINE_TOTAL)*100;
			display_long_two_dp(tempLong);
  		LCD_DisplayDigit(1, LCD_CHAR_F);
	    LCD_DisplayDigit(9, LCD_CHAR_H);
	    LCD_DisplayDigit(8, 2);
     break;

		case 10:		// Phase Sequence - Voltage
// The array i is being used to store voltages
				i[LINE_PHASE_R] = (int16_t)(EM_GetVoltageRMS(LINE_PHASE_R)*10);
				i[LINE_PHASE_Y] = (int16_t)(EM_GetVoltageRMS(LINE_PHASE_Y)*10);
				i[LINE_PHASE_B] = (int16_t)(EM_GetVoltageRMS(LINE_PHASE_B)*10);
				
				tempchar = countVoltageLT50(i[LINE_PHASE_R],i[LINE_PHASE_Y],i[LINE_PHASE_B]);
				if(tempchar==0)
//				if((g_TamperStatus&MISSPOT_MASK)==0)
				{// here no potential is missing
					if(gPhaseSequence==0)
					{
						LCD_DisplayDigit(3, LCD_CHAR_R);
						LCD_DisplayDigit(4, LCD_CHAR_Y);
						LCD_DisplayDigit(5, LCD_CHAR_B);
					}
					else
					{
						LCD_DisplayDigit(3, LCD_CHAR_R);
						LCD_DisplayDigit(4, LCD_CHAR_B);
						LCD_DisplayDigit(5, LCD_CHAR_Y);
					}
				}
				else
				{// here some potential is missing
					LCD_DisplayDigit(3, LCD_MINUS_SIGN);
					LCD_DisplayDigit(4, LCD_MINUS_SIGN);
					LCD_DisplayDigit(5, LCD_MINUS_SIGN);
				}

	    LCD_DisplayDigit(1, LCD_CHAR_V);
	    LCD_DisplayDigit(9, LCD_CHAR_P);
	    LCD_DisplayDigit(8, 5);
     break;

		case 11:		// Phase Sequence - Current
#ifdef CURRENT_PHASE_SEQUENCE		
		  i[LINE_PHASE_R] = (int16_t)(EM_EXT_GetIRMS(LINE_PHASE_R)*100);
		  i[LINE_PHASE_Y] = (int16_t)(EM_EXT_GetIRMS(LINE_PHASE_Y)*100);
		  i[LINE_PHASE_B] = (int16_t)(EM_EXT_GetIRMS(LINE_PHASE_B)*100);
			
			tempchar = countCurrentGT95(i[LINE_PHASE_R],i[LINE_PHASE_Y],i[LINE_PHASE_B]);

			if(tempchar==3)
			{
				if(gPhaseSequenceCurrent==0)
				{
					LCD_DisplayDigit(3, LCD_CHAR_R);
					LCD_DisplayDigit(4, LCD_CHAR_Y);
					LCD_DisplayDigit(5, LCD_CHAR_B);
				}
				else
				{
					LCD_DisplayDigit(3, LCD_CHAR_R);
					LCD_DisplayDigit(4, LCD_CHAR_B);
					LCD_DisplayDigit(5, LCD_CHAR_Y);
				}
			}
			else
			{// here all currents are not greater than 1A
				LCD_DisplayDigit(3, LCD_MINUS_SIGN);
				LCD_DisplayDigit(4, LCD_MINUS_SIGN);
				LCD_DisplayDigit(5, LCD_MINUS_SIGN);
			}
#endif
	    LCD_DisplayDigit(1, LCD_CHAR_C);
	    LCD_DisplayDigit(9, LCD_CHAR_P);
	    LCD_DisplayDigit(8, 5);
     break;
		 
    case 12:		// pf total with sign
    	pf_sign = (EM_PF_SIGN)getInstantaneousParams(PFSIGNVAL,LINE_TOTAL);
			tempLong = getInstantaneousParams(IPFS,LINE_TOTAL)*1000;
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(1, LCD_CHAR_P);	
			LCD_DisplayDigit(2, LCD_CHAR_F);	

			LCD_DisplayDigit(9, LCD_CHAR_T);
			
			if(total_active_power>0)
			{// this is the regular case - import
				if (pf_sign == PF_SIGN_LEAD_C)
				{
		    	LCD_DisplaySpSign(S_LEAD);
				}
				else if (pf_sign == PF_SIGN_LAG_L)
				{
		    	LCD_DisplaySpSign(S_LAG);
				}
			}
			else
			{
				if (pf_sign == PF_SIGN_LEAD_C)
				{
				    LCD_DisplaySpSign(S_LAG);	// show the ulta
				}
				else if (pf_sign == PF_SIGN_LAG_L)
				{
				    LCD_DisplaySpSign(S_LEAD);	// show the ulta
				}
			}
		 break;

    case 13:		// Instant Load in kW
			tempLong = getInstantaneousParams(ACT_POWER,LINE_TOTAL);
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_T);
			LCD_DisplaykWSign();
	    break;

    case 14:		// date
			EM_DisplayDate();
      break;

    case 15:		// time
			EM_DisplayInstantTime();
      break;

	}
}

//avoidShowingRepeatParameters
void handleDisplay_Gujarat(uint8_t t)
{// disp_timer is incremented in the interrupt callback function
	uint8_t previous_disp_state;
  powermgmt_mode_t power_mode;

//	disp_autoscroll_interval=5;
	
	if((g_display_mode==255)||(seconds_flag==0))	// things are not ready yet
		return;
		
		
	power_mode = POWERMGMT_GetMode();	// actual function to be used
		
	if (power_mode == POWERMGMT_MODE1)
	{
#ifdef BIDIR_METER		
		if((g_display_mode==0)&&(disp_state==49))
#else
		if((g_display_mode==0)&&(disp_state==0))
#endif
		{
		}
		else
			EM_LCD_DisplayStatus();
	}

  if((disp_timer >= disp_autoscroll_interval)||(someKeyPressed==1)||(fast_display_flag==1))
	{
		seconds_flag=0;

		if(someKeyPressed==0)
		{
			if(g_display_mode==0)
			{
				if(autoscrollInButtonMode==0)
				{
					previous_disp_state = disp_state;
					if(fast_display_flag==0)
					{
						if(alt_autoscroll_mode==0)
							disp_state++;
						else
						{
							sub_disp_state++;
//							if(sub_disp_state==3)
							if(sub_disp_state==NO_OF_SUB_DISPLAY_STATES)
							{
								sub_disp_state=255;
								alt_autoscroll_mode=0;
								disp_state++;
							}
						}
					}
					else
					{// here fast_display_flag = 1 - wait for autoscroll interval before incrementing state
						fast_display_counter++;
						if(fast_display_counter>disp_autoscroll_interval)
						{
//							disp_state++;
							fast_display_flag=0;
							fast_display_counter=0;
							alt_autoscroll_mode=1;
							sub_disp_state=255;
						}
					}
				}
			}
			else
			{// here we are in those modes which are supposed to operate by pushbutton
			// once button is pressed scrollLock will be made 1, and now display will not scroll
				if(scrollLock==0)
				{
					disp_autoscroll_interval=10;
					disp_state++;	// allow the other displays to scroll if no button is pressed
				}
			}
			disp_timer=0;
		}
		else
		{// here some key has been pressed
			if(mode_has_been_changed==1)
			{
				someKeyPressed=1;	// make sure this remains 1
				if(disp_timer>=2)
				{
					mode_has_been_changed=0;
					fwdKeyPressed=0;	// this is to ensure that after mode display is cleared user must press either key to proceed
					revKeyPressed=0;
				}
				return;
			}
			else
			{
				disp_timer=0;
				someKeyPressed=0;
				mode_timeout_ctr=0;
				avoidShowingRepeatParameters=1;
				scrollLock=1;	// now it will scroll only with press of button
			}
			
			if(fwdKeyPressed==1)
			{
				fwdKeyPressed=0;
				fwdKeyPressedCtr=0;
				if(g_display_mode==0)
				{
					if(autoscrollInButtonMode==0)
					{
						autoscrollInButtonMode=1;
						sub_disp_state=0;
						displayRepeatParameters();	
					}
					else
					{// here autoscrollInButtonMode is 1 and fwdKey is pressed
						if(sub_disp_state==255)
						{
							disp_state++;
							
#ifdef BIDIR_METER								
							if(disp_state>49)
#else
							if(disp_state>19)
#endif
							{// this means that now we are going to come back to state 0
								sub_disp_state=0;
								displayRepeatParameters();	
							}
							else
							 display_autoScroll();
						}
						else
						{
							sub_disp_state++;
//							if(sub_disp_state==3)
							if(sub_disp_state==NO_OF_SUB_DISPLAY_STATES)
							{
								sub_disp_state=255;
								disp_state=0;
								display_autoScroll();
							}
							else
								displayRepeatParameters();
						}
					}
//					return;
				}
				else
					disp_state++;
			}
			
			if(revKeyPressed==1)
			{
				revKeyPressed=0;
				revKeyPressedCtr=0;
				if(g_display_mode==0)
				{
					if(autoscrollInButtonMode==0)
					{
						autoscrollInButtonMode=1;
						sub_disp_state=0;
						displayRepeatParameters();	
					}
					else
					{// here autoscrollInButtonMode is in button mode and REV key is pressed
						if((sub_disp_state>=1)&&(sub_disp_state!=255))
						{
							sub_disp_state--;
							displayRepeatParameters();
						}
						else
						{// here sub_disp_state is either 0 or it is 255
							if((sub_disp_state==0)||(sub_disp_state==255))
							{
								sub_disp_state=255;
								
								if(disp_state==0)
								{// rev button has been pressed
#ifdef BIDIR_METER								
									disp_state=49;
#else
									disp_state=19;
#endif
									display_autoScroll();
								}
								else
								{
									if((disp_state>=1)&&(disp_state!=255))
									{
										disp_state--;
										display_autoScroll();
									}
								}
							}
						}
//						return;	
					}
				}
				else
				{
					if(disp_state==0)
					{
						if(g_display_mode==1)
						{// we are in displayOnDemand mode
#ifdef BIDIR_METER
							disp_state=14;
#else
							disp_state=26;
#endif							
						}
						else
						{
							if(g_display_mode==2)
							{// we are in high res display mode - this has same number of display states for both UNIDIR and BIDIR
								disp_state=3;
							}
						}
					}
					else
					{
//						if(disp_state>=1)
							disp_state--;
					}
				}
			}
		}
		
//		if(mode_has_been_changed==1)
//			return;
			
