Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_Gujarat.c
    case 17:		// total kwh - Cumulative Export
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(myenergydata.kwh_export/100);
			LCD_DisplaykWhSign();
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_EXPORT);
			fast_display_flag=1;
     	break;
			
    case 18:		// total kvarh - lag import
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(myenergydata.kvarh_lag/100);
			LCD_DisplaykVArhSign();
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplaySpSign(S_LAG);
			fast_display_flag=1;
     	break;
			
    case 19:		// total kvarh - lag export
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(myenergydata.kvarh_lag_export/100);
			LCD_DisplaykVArhSign();
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_EXPORT);
			LCD_DisplaySpSign(S_LAG);
			fast_display_flag=1;
     	break;
			
    case 20:		// total kvah import
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(myenergydata.kvah/100);
			LCD_DisplaykVAhSign();
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_IMPORT);
			fast_display_flag=1;
     	break;
			
    case 21:		// total kvah export
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(myenergydata.kvah_export/100);
			LCD_DisplaykVAhSign();
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_EXPORT);
			fast_display_flag=1;
     	break;
			
// Cum Import KWH peak hours

    case 22:		//Import kwh	-	Peak hours script id 1, (scriptid-1)=0
			tempchar=0;	// this is now (scriptid-1)
			if(tempchar==presentZone)
				tempTodKwh=myenergydata.zone_kwh; // myenergydata.zone_kwh - no plus sign needed
			else
				EPR_Read(TOD_CURRENT_BASE_ADDRESS+tempchar*ZONE_PTR_INC, (uint8_t*)&tempTodKwh, sizeof(tempTodKwh));			
			
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(tempTodKwh/100);
			LCD_DisplaykWhSign();
		  LCD_DisplaySpSign(S_TOD);
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplayDigit(9, LCD_CHAR_P);
			LCD_DisplayDigit(8, LCD_CHAR_H);
			fast_display_flag=1;
     break;

// Cum Import KWH night hours
    case 23:			// Import kwh - Night Hours script id 2, (scriptid-1)=1
			tempchar=1; // this is now (scriptid-1)
			if(tempchar==presentZone)
				tempTodKwh=myenergydata.zone_kwh;	// no plus sign needed
			else
				EPR_Read(TOD_CURRENT_BASE_ADDRESS+tempchar*ZONE_PTR_INC, (uint8_t*)&tempTodKwh, sizeof(tempTodKwh));

			displayPrepare();
			lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(tempTodKwh/100);
			LCD_DisplaykWhSign();
		  LCD_DisplaySpSign(S_TOD);
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplayDigit(9, LCD_CHAR_N);
			LCD_DisplayDigit(8, LCD_CHAR_H);
			fast_display_flag=1;
      break;

// Cum Import KWH remaining hours
    case 24:			// T O D - kwh - Remaining Hours , script id 3 & 4, (scriptid-1)=2 & 3
			tempchar=2;// this is now (scriptid-1)
			if(tempchar==presentZone)
				tempTodKwh=myenergydata.zone_kwh;	// no plus sign needed
			else
				EPR_Read(TOD_CURRENT_BASE_ADDRESS+tempchar*ZONE_PTR_INC, (uint8_t*)&tempTodKwh, sizeof(tempTodKwh));
			
// this particular script id is being clubbed with the upper one - SPECIAL			
			tempchar=3;
			if(tempchar==presentZone)
				tempLong=myenergydata.zone_kwh;	// no plus sign needed
			else
				EPR_Read(TOD_CURRENT_BASE_ADDRESS+tempchar*ZONE_PTR_INC, (uint8_t*)&tempLong, sizeof(tempLong));
				
			tempTodKwh+=tempLong;
			
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(tempTodKwh/100);
			LCD_DisplaykWhSign();
		  LCD_DisplaySpSign(S_TOD);
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, LCD_CHAR_H);
			fast_display_flag=1;
      break;

// MD Import kw for present Billing Period
    case 25:		// Current MD in kW
			displayPrepare();
			display_long_three_dp(mymddata.mdkw);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_MD);
			LCD_DisplaySpSign(S_IMPORT);
			fast_display_flag=0;
      break;
			
// MD Import kw for present Billing Period - Peak Hours
    case 26:		//MD Import kw	-	Peak hours script id 1, (scriptid-1)=0
			tempchar=0;	// this is now (scriptid -1)
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+12+tempchar*ZONE_PTR_INC, (uint8_t*)&tempTodMD, sizeof(tempTodMD));
			displayPrepare();
			display_long_three_dp(tempTodMD);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplayDigit(9, LCD_CHAR_P);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     break;

// MD Import kw for present Billing Period - Night Hours
    case 27:		//MD Import kw	-	script id 2, (scriptid-1)=1
			tempchar=1;	// this is now (scriptid-1)
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+12+tempchar*ZONE_PTR_INC, (uint8_t*)&tempTodMD, sizeof(tempTodMD));
			displayPrepare();
			display_long_three_dp(tempTodMD);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplayDigit(9, LCD_CHAR_N);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     break;

// MD Import kw for present Billing Period - Remaining Hours
    case 28:		//MD Import kw	-	Remaining hours script id 3 & 4, (scriptid-1)=2 & 3
			tempchar=2; // this is now (scriptid-1)
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+12+tempchar*ZONE_PTR_INC, (uint8_t*)&tempTodMD, sizeof(tempTodMD));

// this particular script id is being clubbed with the upper one - SPECIAL			
			
