Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_Gujarat.c
			tempchar=3;
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+12+tempchar*ZONE_PTR_INC, (uint8_t*)&tempint, sizeof(tempint));

// we will not display date and time
			if(tempint>tempTodMD)
			{// we display tempTodMD which should contain the higher value
				tempTodMD = tempint;
			}
			
			displayPrepare();
			display_long_three_dp(tempTodMD);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     break;

// MD Import kw for last Billing Period - this is now 4 bytes
    case 29:		// L1 - MD
      tempchar = 1;
      tmonth = decrementMonth(tempchar);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+72,(uint8_t*)&tempLong,4);
			displayPrepare();
      display_long_three_dp(tempLong);
		  LCD_DisplaySpSign(S_BILL);
			LCD_DisplaykWSign();
			LCD_DisplaySpSign(S_IMPORT);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
	    break;

// MD Import kw for last Billing Period - Peak Hours - 4bytes
    case 30:		//MD Import kw	-	Peak hours script id 1, (scriptid-1)=0
		// this information is to be picked up from Billing area in e2rom
      tmonth = decrementMonth(1);
			tempchar=0;	// this is now (scriptid-1)
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC + 88 + (tempchar*4),(uint8_t*)&tempLong1,sizeof(tempLong1));
			displayPrepare();
			display_long_three_dp(tempLong1);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_BILL);
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplayDigit(9, LCD_CHAR_P);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     	break;

// MD Import kw for last Billing Period - Night Hours
    case 31:		//MD Import kw	-	Night hours script id 2, (scriptid-1)=1
		// this information is to be picked up from Billing area in e2rom
      tmonth = decrementMonth(1);
			tempchar=1; // this is now (scriptid-1)
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC + 88 + (tempchar*4),(uint8_t*)&tempLong1,sizeof(tempLong1));
			displayPrepare();
			display_long_three_dp(tempLong1);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_BILL);
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplayDigit(9, LCD_CHAR_N);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     	break;

// MD Import kw for last Billing Period - Remaining Hours
    case 32:		//MD Import kw	-	Remaining hours script id 3 & 4, (scriptid-1)=2 & 3
		// this information is to be picked up from Billing area in e2rom
      tmonth = decrementMonth(1);
			tempchar=2;	// this is now (scriptid-1)
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC + 88 + (tempchar*4),(uint8_t*)&tempLong1,sizeof(tempLong1));
			
// this particular script id is being clubbed with the upper one - SPECIAL			
				
			tempchar=3;
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC + 88 + (tempchar*4),(uint8_t*)&tempLong,sizeof(tempLong));

			if(tempLong1>tempLong)
			{// we display tempTodMD which should contain the higher value
				tempLong = tempLong1;
			}
			
			displayPrepare();
			display_long_three_dp(tempLong);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_BILL);
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     	break;

// MD Export kw for present Billing Period
    case 33:		// Current MD Export in kW
			displayPrepare();
			display_long_three_dp(mymddata.mdkw_export);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_MD);
			LCD_DisplaySpSign(S_EXPORT);
			fast_display_flag=0;
      break;

// MD Export kw for present Billing Period - Peak Hours
    case 34:		//MD Export kw	-	Peak hours script id 1, (scriptid-1)=0
			tempchar=0;
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+40+tempchar*ZONE_PTR_INC, (uint8_t*)&tempTodMD, sizeof(tempTodMD));
			displayPrepare();
			display_long_three_dp(tempTodMD);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_EXPORT);
			LCD_DisplayDigit(9, LCD_CHAR_P);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     break;

// MD Export kw for present Billing Period - Night Hours
    case 35:		//MD Export kw	- Night hours	script id 2, (scriptid-1)=1
			tempchar=1;	// this is now (scriptid-1)
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+40+tempchar*ZONE_PTR_INC, (uint8_t*)&tempTodMD, sizeof(tempTodMD));
			displayPrepare();
			display_long_three_dp(tempTodMD);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_EXPORT);
			LCD_DisplayDigit(9, LCD_CHAR_N);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     break;

// MD Export kw for present Billing Period - Remaining Hours
    case 36:		//MD Export kw	-	Remaining hours scriptid 3 & 4, (scriptid-1)=2 & 3
			tempchar=2;	// this is now (scriptid-1)
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+40+tempchar*ZONE_PTR_INC, (uint8_t*)&tempTodMD, sizeof(tempTodMD));
			
// this particular script id is being clubbed with the upper one - SPECIAL			

			tempchar=3;
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+40+tempchar*ZONE_PTR_INC, (uint8_t*)&tempint, sizeof(tempint));

// we will not display date and time
			if(tempint>tempTodMD)
			{// we display tempTodMD which should contain the higher value
				tempTodMD = tempint;
			}
			
			displayPrepare();
			display_long_three_dp(tempTodMD);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_EXPORT);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     break;

// MD Export kw for last Billing Period
    case 37:		// L1 - MD Export 
      tempchar = 1;
      tmonth = decrementMonth(tempchar);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+344,(uint8_t*)&tempLong,sizeof(tempLong));
			displayPrepare();
      display_long_three_dp(tempLong);
		  LCD_DisplaySpSign(S_MD);
		  LCD_DisplaySpSign(S_BILL);
			LCD_DisplaykWSign();
			LCD_DisplaySpSign(S_EXPORT);
			fast_display_flag=0;
	    break;

// MD Export kw for last Billing Period - Peak Hours
    case 38:		//MD Export kw	-	Peak hours , scriptid 1, (scriptid-1)=0
		// this information is to be picked up from Billing area in e2rom
      tmonth = decrementMonth(1);
			tempchar=0;	// this is now (scriptid-1)
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC + 360 + (tempchar*4),(uint8_t*)&tempLong1,sizeof(tempLong1));
			displayPrepare();
			display_long_three_dp(tempLong1);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_BILL);
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_EXPORT);
			LCD_DisplayDigit(9, LCD_CHAR_P);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     	break;
			
// MD Export kw for last Billing Period - Night Hours
    case 39:		//MD Export kw	-	Night hours scriptid 2, (scriptid-1)=1
		// this information is to be picked up from Billing area in e2rom
      tmonth = decrementMonth(1);
			tempchar=1;	// this is now (scriptid-1)
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC + 360 + (tempchar*4),(uint8_t*)&tempLong1,sizeof(tempLong1));
			displayPrepare();
			display_long_three_dp(tempLong1);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_BILL);
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_EXPORT);
			LCD_DisplayDigit(9, LCD_CHAR_N);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     	break;

// MD Export kw for last Billing Period - Remaining Hours
    case 40:		//MD Export kw	-	Remaining hours scriptid 3 & 4, (scriptid-1)=2 & 3
		// this information is to be picked up from Billing area in e2rom
      tmonth = decrementMonth(1);
			tempchar=2;	// this is now (scriptid-1)
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC + 360 + (tempchar*4),(uint8_t*)&tempLong1,sizeof(tempLong1));
			
