Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_Gujarat.c
// this particular script id is being clubbed with the upper one - SPECIAL			

			tempchar=3;
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC + 360 + (tempchar*4),(uint8_t*)&tempLong,sizeof(tempLong));

			if(tempLong1>tempLong)
			{// we display tempTodMD which should contain the higher value
				tempLong = tempLong1;
			}

			displayPrepare();
			display_long_three_dp(tempLong);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_BILL);
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_EXPORT);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     	break;

// Non Solar hour Export kwh
    case 41:		//Non Solar Export kwh
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(myenergydata.kwh_nonSolar_export/100);
			LCD_DisplaykWhSign();
			LCD_DisplaySpSign(S_EXPORT);
 	    LCD_DisplayDigit(9, LCD_CHAR_N);
 	    LCD_DisplayDigit(8, 5);
			fast_display_flag=1;
			break;

// Solar hour Export kwh
    case 42:		//Solar hours Export kwh
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(myenergydata.kwh_Solar_export/100);
			LCD_DisplaykWhSign();
			LCD_DisplaySpSign(S_EXPORT);
// 	    LCD_DisplayDigit(9, LCD_CHAR_N);
 	    LCD_DisplayDigit(9, 5);
 	    LCD_DisplayDigit(8, LCD_CHAR_O);
			fast_display_flag=1;
			break;

// Solar hours Import kwh
    case 43:		//Solar hours Import kwh
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(myenergydata.kwh_Solar_import/100);
			LCD_DisplaykWhSign();
			LCD_DisplaySpSign(S_IMPORT);
// 	    LCD_DisplayDigit(9, LCD_CHAR_N);
 	    LCD_DisplayDigit(9, 5);
 	    LCD_DisplayDigit(8, LCD_CHAR_O);
			fast_display_flag=1;
			break;

// Cumulative MD in Import KW
    case 44:		// Cumulative MD in kW
			displayPrepare();
			display_long_three_dp(ctldata.cumulative_md);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
		  LCD_DisplaySpSign(S_MD);
  		LCD_DisplaySpSign(S_IMPORT);
			fast_display_flag=0;
      break;

// Reset Count - billing count
    case 45:		// billing count
			displayPrepare();
			LCD_DisplayIntWithPos(Common_Data.bpcount, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_P);
		  LCD_DisplaySpSign(S_D1);	// this will convert the P to R
			LCD_DisplayDigit(8, LCD_CHAR_C);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;

// Total tamper Count
    case 46:		// Total Tamper count
			displayPrepare();
			LCD_DisplayIntWithPos(mytmprdata.tamperCount, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_T);
			LCD_DisplayDigit(8, LCD_CHAR_C);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;

// Programming Count
    case 47:		// programming count
			displayPrepare();
			LCD_DisplayIntWithPos(Common_Data.pgm_count, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_P);
			LCD_DisplayDigit(8, LCD_CHAR_C);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;

// Anomaly / circuit check in meter display
/*
		 	RTC failure and EEPROM status
        Digit 1- if �1� then it means that at present a voltage related tamper is going on
        Digit 2- if �1� then it means that at present a current related tamper is going on
        Digit 3- if �1� then it means that at present any other tamper is going on
        Digit 4- if �1� then it means that at present RTC battery is low
        Digit 5- if �1� then it means that at that EEPROM failure is there
    If none of the above anomaly is there then we will show �00000� or �GGGGG� if all are there then 
			we will show �11111�/�FFFFF� or sir may decide any other type of display which is easier to implement.				
*/

    case 48:		// e2rom check , rtc check
			displayPrepare();
		
			tempLong = maskTable[MISSING_POTENTIAL_R]|maskTable[MISSING_POTENTIAL_Y]|maskTable[MISSING_POTENTIAL_B];
			tempLong |= maskTable[OVER_VOLTAGE]|maskTable[UNDER_VOLTAGE]|maskTable[VOLTAGE_UNBALANCED];
			
			if((mytmprdata.tamperEvent_image&tempLong)==0)
			{// there are no voltage related tampers
				LCD_DisplayDigit(2, 1);
			}
			else
			{// there are voltage related tampers
				LCD_DisplayDigit(2, LCD_CHAR_V);
			}

			tempLong = maskTable[CT_REVERSED_R]|maskTable[CT_REVERSED_Y]|maskTable[CT_REVERSED_B];
			tempLong |= maskTable[CT_OPEN_R]|maskTable[CT_OPEN_Y]|maskTable[CT_OPEN_B];
			tempLong |= maskTable[CURRENT_UNBALANCED]|maskTable[CT_BYPASS]|maskTable[OVER_CURRENT];
			
			if((mytmprdata.tamperEvent_image&tempLong)==0)
			{// there are no current related tampers
				LCD_DisplayDigit(3, 1);
			}
			else
			{// there are current related tampers
				LCD_DisplayDigit(3, LCD_CHAR_C);
			}

			tempLong = maskTable[MAGNET]|maskTable[AC_MAGNET]|maskTable[NEUTRAL_DISTURBANCE]|maskTable[COVER_OPEN];
			
			if((mytmprdata.tamperEvent_image&tempLong)==0)
			{// there are no other tampers
				LCD_DisplayDigit(4, 1);
			}
			else
			{// there are other tampers
				LCD_DisplayDigit(4, LCD_CHAR_O);
			}
// now for rtc battery check - this is being made 1 always - better still remove it
/*
			if(0==POWERMGMT_ISVRTCLOW())
//				LCD_DisplayDigit(5, LCD_CHAR_G);	// battery voltage is Not Low 
				LCD_DisplayDigit(5, 1);	// battery voltage is Not Low 
			else
//				LCD_DisplayDigit(5, LCD_CHAR_F);	// battery voltage is Low
				LCD_DisplayDigit(5, 1);	// battery voltage is Low
*/				
// now for E2rom check				
			tempchar=perform_E2ROM_Test(0);
			if(tempchar==0)
			{// e2rom is good
				LCD_DisplayDigit(5, 1);	// e2rom is good
			}
			else
			{// E2ROM is failed
				LCD_DisplayDigit(5, LCD_CHAR_M);	// e2rom is failed
			}
			
			LCD_DisplayDigit(9, LCD_CHAR_A);
			LCD_DisplayDigit(8, LCD_CHAR_N);
      break;

// Display check
    case 49:		// all on
      LCD_DisplayAll();
			fast_display_flag=0;
//      disp_state=255;
      break;
	}
}

//int8_t testctr;
void display_onDemand(void)
{
//	toddata_t temptoddata;
	int32_t tempTodKwh;
  powermgmt_mode_t power_mode;
	int32_t tempLong;
	uint16_t tempint;
	ext_rtc_t datetime;
	EM_PF_SIGN pf_sign;    
	uint8_t tempchar;
	uint8_t tmonth;

  R_WDT_Restart();
  LCD_ClearAll();

